# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [1]:
# import numpy and pandas
import numpy as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents. Please, load the data using Ironhack's database (db: employees, table: employees_advanced).

In [58]:
# Your code here:
employees = pd.read_csv("Employees_advanced.csv")
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33183 entries, 0 to 33182
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33183 non-null  object
 1   Job Titles         33183 non-null  object
 2   Department         33183 non-null  object
 3   Full or Part-Time  33183 non-null  object
 4   Salary or Hourly   33183 non-null  object
 5   Typical Hours      8022 non-null   float64
 6   Annual Salary      25161 non-null  float64
 7   Hourly Rate        8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

Examine the `salaries` dataset using the `head` function below.

In [4]:
# Your code here:
employees.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [7]:
# Your code here:
employees.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [9]:
employees['Salary or Hourly'].value_counts()

Salary    25161
Hourly     8022
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [10]:
# Your code here:
dpt = employees.groupby(['Department'])['Name'].count()
dpt

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Name, dtype: int64

# Challenge 2 - Hypothesis Tests

__In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.__

In [15]:
#The population std is unknown so we're going to to a t statstic
from scipy import stats
from scipy.stats import ttest_1samp
employees.head(2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN

In [12]:
# Your code here:
#1- Define the null and alternative hypotheses: H0: μ = μ0 Ha: μ ≠ μ0
#2- Select a significance level (α): The significance level is set to 0.05, which means that there is a 5% chance of rejecting the null hypothesis when it is actually true.

In [26]:
#3- Identify sample mean (x̄) / sample standard deviation (s)/ population mean μ
x̄ = employees.loc[employees['Hourly Rate'].isnull()==False, 'Hourly Rate'].mean()
print('the sample mean of salarly is :',  x̄)
s = employees.loc[employees['Hourly Rate'].isnull()==False, 'Hourly Rate'].std()
print('the sample std of salarly is :',  s)
n = employees.loc[employees['Hourly Rate'].isnull()==False, 'Hourly Rate'].count()
print('the sample size of salarly is :',  n)

the sample mean of salarly is : 32.78855771628128
the sample std of salarly is : 12.11257268427681
the sample size of salarly is : 8022

In [28]:
# Generate a sample of random data 
np.random.seed(0)
sample = np.random.normal(x̄, s, n)

# Perform a two-tailed T-test to compare the mean of the sample to a population mean of 30
t_statistic, p_value = ttest_1samp(sample, 30)

if p_value < 0.05:
    print("Reject the null hypothesis. The mean of the sample is not equal to the population mean.")
else:
    print("Fail to reject the null hypothesis. The mean of the sample is equal to the population mean.")

Reject the null hypothesis. The mean of the sample is not equal to the population mean.

In [30]:
ttest_1samp(sample, 30)

Ttest_1sampResult(statistic=19.609396785358584, pvalue=1.1453877507211451e-83)

_Other way to do it_

In [32]:
#Calculate the t statistic t = (x̄ - μ0) / (s / √n)
df = n - 1
μ = 30
t = (x̄ - μ) / (s / np.sqrt(n))
t

20.619805785501907

In [34]:
#find the critical value
from scipy import stats

alpha = 0.05

tcritical = stats.t.ppf(1 - alpha / 2, df)
print(tcritical)

1.9602597859561675

In [ ]:
#In both cases T-statistic is greater than the critical value, so we reject the null hypothesis. 
#So we can consider that the hourly wage of all hourly workers is significantly different from $30/hr.

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [42]:
#First we need to select the rows with police department and check if there is any null values in annual Salary
Police = employees.loc[(employees['Department'] == "POLICE") & (employees['Annual Salary'].isnull()==False)]
Police.isnull().sum()
#now we're wure that there is no null values in annual salary column

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        13404
Annual Salary            0
Hourly Rate          13404
dtype: int64

In [47]:
#The population std is also unknown so a t-test will be used in this case 
x = Police['Annual Salary'].mean()
print('the sample mean of police annual salarly is :',  x)
μ = 86000
s = Police['Annual Salary'].std()
print('the sample std of police annual salarly is :',  s)
n = Police['Annual Salary'].count()
print('the sample size of police is :',  n)

the sample mean of police annual salarly is : 86486.41450313339
the sample std of police annual salarly is : 18272.228293992157
the sample size of police is : 13404

In [48]:
Police.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN

In [51]:
#Calculate the t statistic t = (x̄ - μ0) / (s / √n)
df = n - 1 #Degree of freedom
t = (x - μ) / (s / np.sqrt(n))
t

3.08199700571315

In [53]:
from scipy import stats

alpha = 0.05

tcritical = stats.t.ppf(1 - alpha, df)
print(tcritical)

1.6449673235204956

In [ ]:
# T-statistic (3.08) is greater than the critical value (1.644), so we reject the null hypothesis.

Using the `crosstab` function, find the department that has the most hourly workers.

In [56]:
# Your code here:
dpt_hourly = pd.crosstab(employees.Department, employees["Salary or Hourly"], margins=True, margins_name="Total")
dpt_hourly.sort_values('Hourly', ascending = False)
#the department that has the most hourly workers is STREETS & SAN

Salary or Hourly       Hourly  Salary  Total
Department
Total                    8022   25161  33183
STREETS & SAN            1862     336   2198
WATER MGMNT              1513     366   1879
OEMC                     1273     829   2102
AVIATION                 1082     547   1629
GENERAL SERVICES          765     215    980
TRANSPORTN                725     415   1140
PUBLIC LIBRARY            299     716   1015
FAMILY & SUPPORT          287     328    615
CITY COUNCIL               64     347    411
FINANCE                    44     516    560
LAW                        40     367    407
ANIMAL CONTRL              19      62     81
POLICE                     10   13404  13414
MAYOR'S OFFICE              8      77     85
BUSINESS AFFAIRS            7     164    171
CULTURAL AFFAIRS            7      58     65
HUMAN RESOURCES             4      75     79
COMMUNITY DEVELOPMENT       4     203    207
HEALTH                      3     485    488
FIRE                        2    4639   4641
PROCUREMENT                 2      90     92
BUDGET & MGMT               2      44     46
BOARD OF ETHICS             0       8      8
TREASURER                   0      22     22
POLICE BOARD                0       2      2
BOARD OF ELECTION           0     107    107
BUILDINGS                   0     269    269
LICENSE APPL COMM           0       1      1
INSPECTOR GEN               0      87     87
HUMAN RELATIONS             0      16     16
DoIT                        0      99     99
DISABILITIES                0      28     28
COPA                        0     116    116
CITY CLERK                  0      84     84
ADMIN HEARNG                0      39     39

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [62]:
# Your code here:
x̄ = employees.loc[(employees['Hourly Rate'].isnull()==False) & (employees['Department']=="STREETS & SAN"), 'Hourly Rate'].mean()
print('the sample mean of salarly is :',  x̄)
s = employees.loc[(employees['Hourly Rate'].isnull()==False) & (employees['Department']=="STREETS & SAN"), 'Hourly Rate'].std()
print('the sample std of salarly is :',  s)
n = employees.loc[(employees['Hourly Rate'].isnull()==False) & (employees['Department']=="STREETS & SAN"), 'Hourly Rate'].count()
print('the sample size of salarly is :',  n)

the sample mean of salarly is : 33.728378088076845
the sample std of salarly is : 5.735241841459193
the sample size of salarly is : 1862

In [64]:
#Calculate the t statistic t = (x̄ - μ0) / (s / √n)
df = n - 1
μ = 30
t = (x̄ - μ) / (s / np.sqrt(n))
t

28.051626611196657

In [66]:
#find the critical value
#In this cas one tail t-tes
from scipy import stats

alpha = 0.05

tcritical = stats.t.ppf(1 - alpha, df)
print(tcritical)

1.6456728276882662

In [67]:
#T-statistic is greater than the critical value, so we reject the null hypothesis. 
#So we can consider that the hourly wage of STREETS & SAN hourly workers is significantly less than $35/hourr.

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [68]:
# Your code here:
x̄ = employees.loc[employees['Hourly Rate'].isnull()==False, 'Hourly Rate'].mean()
print('the sample mean of salarly is :',  x̄)
s = employees.loc[employees['Hourly Rate'].isnull()==False, 'Hourly Rate'].std()
print('the sample std of salarly is :',  s)
n = employees.loc[employees['Hourly Rate'].isnull()==False, 'Hourly Rate'].count()
print('the sample size of salarly is :',  n)

the sample mean of salarly is : 32.78855771628128
the sample std of salarly is : 12.11257268427681
the sample size of salarly is : 8022

In [70]:
z = stats.norm.ppf(1 - alpha / 2)
lower, upper = x̄ - z * s / np.sqrt(n), x̄ + z * s / np.sqrt(n)
print(f"The 95% confidence interval for the mean is: [{lower:.2f}, {upper:.2f}]")

The 95% confidence interval for the mean is: [32.52, 33.05]

__doing it with interval__

In [71]:
#First we need to select the rows with all non null Salarly
salarly = employees.loc[employees['Hourly Rate'].isnull()==False]
salarly.head()
#now we're wure that there is no null values in annual salary column

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68

In [73]:
import scipy.stats as st
st.t.interval(alpha=0.95, df=len(salarly["Hourly Rate"])-1, loc=np.mean(salarly["Hourly Rate"]), scale=st.sem(salarly["Hourly Rate"]))

C:\Users\Rachad\AppData\Local\Temp\ipykernel_13340\868293925.py:2: DeprecationWarning: Use of keyword argument `alpha` for method `interval` is deprecated. Use first positional argument or keyword argument `confidence` instead.
  st.t.interval(alpha=0.95, df=len(salarly["Hourly Rate"])-1, loc=np.mean(salarly["Hourly Rate"]), scale=st.sem(salarly["Hourly Rate"]))

(32.52345834488529, 33.05365708767727)

In [ ]:
#we get same results from both methods

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [74]:
Police.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN

In [75]:
import scipy.stats as st
st.t.interval(alpha=0.95, df=len(Police["Annual Salary"])-1, loc=np.mean(Police["Annual Salary"]), scale=st.sem(Police["Annual Salary"]))

C:\Users\Rachad\AppData\Local\Temp\ipykernel_13340\2918925735.py:2: DeprecationWarning: Use of keyword argument `alpha` for method `interval` is deprecated. Use first positional argument or keyword argument `confidence` instead.
  st.t.interval(alpha=0.95, df=len(Police["Annual Salary"])-1, loc=np.mean(Police["Annual Salary"]), scale=st.sem(Police["Annual Salary"]))

(86177.05631531784, 86795.77269094894)

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [13]:
# Your code here: